# LineColor Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
MEPSystemType..::..LineColor Property
MEPSystemType Class See Also
---
Indicates the color that should override the line color for all components in the system.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public Color LineColor { get; set; }
```

Visual Basic
---
```text
Public Property LineColor As Color
	Get
	Set
```

Visual C++
---
```text
public:
property Color^ LineColor {
	Color^ get ();
	void set (Color^ value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | When setting this property: A non-optional argument was null |

# See Also
MEPSystemType Class
Autodesk.Revit.DB Namespace